#error this file should not be in the build

#include <stdio.h>
#include "McdCheck.h"
#include "McdPS2Core.h"
#include "MeAssert.h"

static void Vec3Abs(lsVec3 &out, const lsVec3 &in)
{
    out[0] = MeFabs(in[0]);
    out[1] = MeFabs(in[1]);
    out[2] = MeFabs(in[2]);
}

static void Vec4Spread(lsVec4 &vec, MeReal r)
{
    vec[0] = vec[1] = vec[2] = vec[3] = r;
}

static int SegmentCubeIntersect(MeReal *tInMax, MeReal *tOutMin, const lsVec3 &orig,
                                const lsVec3 &disp, const lsVec3 &invDisp,
                                const lsVec3 &inR) {
    const MeReal eps = (MeReal)1e-6;
    int j;
    lsVec3 z0,z1,adisp, aorig, epsV(eps,eps,eps);
    lsVec3 tInV, tOutV;
    
    // Early out for when one of the lines is axis-perpendicular 
    // and the line origin for that axis is outside the box

    Vec3Abs(adisp, disp);
    Vec3Abs(aorig, orig);

    int small = adisp <  epsV;

    if(small & (aorig > inR))
        return 0;

    Vec3Abs(z0, invDisp);
    z0*=inR;

    (z1 = orig) *= -invDisp;

    tInV = z1-z0;
    tOutV = z1+z0;

    for (j = 0; j < 3; j++) 
    { // j = axis of box A        
        if(!(small&(1<<j)))
        {
            if (tInV[j] > *tInMax) *tInMax = tInV[j];
            if (tOutV[j] < *tOutMin) *tOutMin = tOutV[j];
            if (*tOutMin < *tInMax) 
                return 0; 
        }
    }
    return 1;
}

static void AddTriBoxSegmentPoints(lsVec3* &outList, const lsVec3 &inRBox,

    d0*=den;
    d1*=den;
    d2*=den;

    Vec4Spread(rV,inTriD);
    rV.addMultiple(inRBox[i1]*inTri.mNormal[i1], m1);
    rV.addMultiple(inRBox[i2]*inTri.mNormal[i2], m2);
    rV *= recipDen;

    for(j=0;j<4;j++)
    {
        if (d0[j] >= (MeReal)(0.0) &&
            d1[j] >= (MeReal)(0.0) &&
            d2[j] >= (MeReal)(0.0) && rV[j]>=-r0 && rV[j]<=r0) 
        {  // points at triangle
            outList->operator[](i0) = rV[j];
            outList->operator[](i1) = -m1[j]*inRBox[i1];
            outList->operator[](i2) = -m2[j]*inRBox[i2];
            outList++;
        }
    }
}

static void AddBoxEndSegmentPoints(lsVec3* &outList, const lsVec3 &orig, const lsVec3 &disp,
                            const lsVec3 &inR) 
{
  MeReal tIn = (MeReal)(0.0);
  MeReal tOut = (MeReal)(1.0);
  const lsVec3 invDisp((MeReal)(1.0)/disp[0],
                       (MeReal)(1.0)/disp[1],
                       (MeReal)(1.0)/disp[2]);
  if (SegmentCubeIntersect(&tIn,&tOut,orig,disp,invDisp,inR)) 
  {
    *outList++ = orig+tIn*disp;
    if (tOut < (MeReal)1.0) 
      *outList++ = orig+tOut*disp;
  }
}

void McdPS2Core::BoxTriIntersect(lsVec3* &outList, const lsVec3 &inRBox, const CxTriangleNE &inTri) 
{
    AddBoxEndSegmentPoints(outList,*inTri.mVertex[0],inTri.mEdge[0],inRBox);
    AddBoxEndSegmentPoints(outList,*inTri.mVertex[1],inTri.mEdge[1],inRBox);
    AddBoxEndSegmentPoints(outList,*inTri.mVertex[2],inTri.mEdge[2],inRBox);
    
    lsVec3 axb[3];
    axb[0] = inTri.mVertex[0]->cross(*inTri.mVertex[1]);
    axb[1] = inTri.mVertex[1]->cross(*inTri.mVertex[2]);
    axb[2] = inTri.mVertex[2]->cross(*inTri.mVertex[0]);
    
    const MeReal triD = inTri.mVertex[0]->dot(inTri.mNormal);
    
    if (inTri.mNormal[0] != (MeReal)(0.0)) {
        AddTriBoxSegmentPoints(outList,inRBox,0,1,2,inTri,axb,triD); // x-direction edges
    }
    if (inTri.mNormal[1] != (MeReal)(0.0)) {
        AddTriBoxSegmentPoints(outList,inRBox,1,2,0,inTri,axb,triD); // y-direction edges
    }
    if (inTri.mNormal[2] != (MeReal)(0.0)) {
        AddTriBoxSegmentPoints(outList,inRBox,2,0,1,inTri,axb,triD); // z-direction edges
    }
}


/*
    OverlapOBBTri
    -------------

    Attempts to find a separating plane between a given triangle and box
    If there is one, the function returns
    If not, the footprint of the intersection is calculated

    Cases for separating planes:

    Face of triangle
    Face of OBB
    

    On Entry:   (input is 8 quadwords)

    inEps    -
    inR      - radius of box (in each direction)
    inTri    - triangle to test (contains vertices,edges and normal)

    On Exit:

    outSep   - closest distance between objects
    outN     - vector specifying direction of line of closest distance
    outPN    - distance between centre of box and closest festure
    outPos   - footprint of intersection
    outDims  - description of the intersection eg face/edge

*/

MeReal obbtriconstants[4] __attribute__ ((aligned(64))) = { 0.5f, 1.0f, 0.0f, 0.0f };

typedef struct {
    MeVector4 inR;
    MeVector4 aNorm;
    MeVector4 mNormal;
    MeVector4 mVertex0;
    MeVector4 sumR;
    MeVector4 normD;
    MeVector4 aNormD;
    MeVector4 maxSeparation;
    MeVector4 minCoord;
    MeVector4 maxCoord;
    MeVector4 sumRV;
    MeVector4 normDV;             
    MeVector4 sepV;
    MeVector4 p3_maxSeparation;
    MeVector4 p4_maxSeparation;
    MeVector4 p5_maxSeparation;
    MeVector4 aE0;
    MeVector4 aE1;
    MeVector4 aE2;
    MeVector4 sqE0;
    MeVector4 sqE1;
    MeVector4 sqE2;
    MeVector4 negaE0;
    MeVector4 negaE1;
    MeVector4 negaE2;
    MeVector4 p7_em;
    MeVector4 p7_en;
    MeVector4 p7_vm;
    MeVector4 p7_vn;
    MeVector4 p7_sRV;
    MeVector4 p7_rBV;
    MeVector4 p7_rLenV;
    MeVector4 p7_sepV;            // 0x200

    MeVector4 p8_rlen;              // 0x210
    MeVector4 p8_eps2;              // 0x220
    MeVector4 p9_maxSeparation;     // 0x230
    MeVector4 p9_PN;                // 0x240
    MeVector4 p9_normalsign;        // 0x250
    MeVector4 p9_nRLen;             // 0x260

    MeVector4 p10_rlen;             // 0x270
    MeVector4 p10_eps2;             // 0x280
    MeVector4 p11_maxSeparation;    // 0x290
    MeVector4 p11_PN;               // 0x2a0
    MeVector4 p11_normalsign;       // 0x2b0
    MeVector4 p11_nRLen;            // 0x2c0

    MeVector4 p12_rlen;             // 0x2d0
    MeVector4 p12_eps2;             // 0x2e0
    MeVector4 p13_maxSeparation;    // 0x2f0
    MeVector4 p13_PN;               // 0x300
    MeVector4 p13_normalsign;       // 0x310
    MeVector4 p13_nRLen;            // 0x320

    MeVector4 p14_em;               // 0x330
    MeVector4 p14_en;               // 0x340
    MeVector4 p14_vm;               // 0x350
    MeVector4 p14_vn;               // 0x360
    MeVector4 p14_sRV;              // 0x370
    MeVector4 p14_rBV;              // 0x380
    MeVector4 p14_rLenV;            // 0x390
    MeVector4 p14_sepV;             // 0x3a0

    MeVector4 p15_rlen;             // 0x3b0
    MeVector4 p15_eps2;             // 0x3c0
    MeVector4 p16_maxSeparation;    // 0x3d0
    MeVector4 p16_PN;               // 0x3e0
    MeVector4 p16_normalsign;       // 0x3f0
    MeVector4 p16_nRLen;            // 0x400

    MeVector4 p17_rlen;             // 0x410             
    MeVector4 p17_eps2;             // 0x420
    MeVector4 p18_maxSeparation;    // 0x430
    MeVector4 p18_PN;               // 0x440
    MeVector4 p18_normalsign;       // 0x450
    MeVector4 p18_nRLen;            // 0x460

    MeVector4 p19_rlen;             // 0x470
    MeVector4 p19_eps2;             // 0x480
    MeVector4 p20_maxSeparation;    // 0x490
    MeVector4 p20_PN;               // 0x4a0
    MeVector4 p20_normalsign;       // 0x4b0
    MeVector4 p20_nRLen;            // 0x4c0

    MeVector4 p21_em;               // 0x4d0
    MeVector4 p21_en;               // 0x4e0
    MeVector4 p21_vm;               // 0x4f0
    MeVector4 p21_vn;               // 0x500
    MeVector4 p21_sRV;              // 0x510
    MeVector4 p21_rBV;              // 0x520
    MeVector4 p21_rLenV;            // 0x530
    MeVector4 p21_sepV;           // 0x540

    MeVector4 p22_rlen;             // 0x550
    MeVector4 p22_eps2;             // 0x560
    MeVector4 p23_maxSeparation;    // 0x570
    MeVector4 p23_PN;               // 0x580
    MeVector4 p23_normalsign;       // 0x590
    MeVector4 p23_nRLen;            // 0x5a0

    MeVector4 p24_rlen;             // 0x5b0             
    MeVector4 p24_eps2;             // 0x5c0
    MeVector4 p25_maxSeparation;    // 0x5d0
    MeVector4 p25_PN;               // 0x5e0
    MeVector4 p25_normalsign;       // 0x5f0
    MeVector4 p25_nRLen;            // 0x600

    MeVector4 p26_rlen;             // 0x610
    MeVector4 p26_eps2;             // 0x620
    MeVector4 p27_maxSeparation;    // 0x630
    MeVector4 p27_PN;               // 0x640
    MeVector4 p27_normalsign;       // 0x650
    MeVector4 p27_nRLen;            // 0x660

} debugdata;

debugdata debug __attribute__ ((aligned(64)));

#define printvec(x,s) printf("%20s = %12.6f %12.6f %12.6f \n",(s),(x)[0],(x)[1],(x)[2]);
#define printreal(x,s) printf("%20s = %12.6f \n",(s),(x)[0]);
#define printint(x,s) printf("%20s = %12d \n",(s),((int *)x)[0]);

MeReal normalSign[4]    __attribute__ ((aligned(64)));
MeReal maxSeparation[4] __attribute__ ((aligned(64)));
MeReal PN[4]            __attribute__ ((aligned(64)));
MeReal nRLen[4]         __attribute__ ((aligned(64)));

int   normInfo;

#define DUMPDEBUGDATA 0

bool McdPS2Core::OverlapOBBTri(MeReal &              outSep,   /* Output */ 
                               lsVec3 &              outN,     /* Output */ 
                               MeReal &              outPN,    /* Output */ 
                               lsVec3* &             outPos,   /* Output */ 
                               MeI16 &               outDims,  /* Output */ 
